% Задание 11: Прореживание сигнала и воспроизведение
% Прореживаем массив y, оставляя лишь каждый 10-й отсчет
y1 = downsample(y, 10); 

% Новая частота дискретизации стала в 10 раз меньше (4800 Гц)
Fs_new = Fs / 10; 

% Создаем объект audioplayer
zvuk = audioplayer(y1, Fs_new); 

% Воспроизводим испорченный звук
play(zvuk); 
disp('Воспроизводится прореженный звук... Для остановки напиши stop(zvuk) в консоли.');

% Визуализируем амплитуду прореженного сигнала от времени
figure;
plot(y1, 'b'); 
title('Амплитуда прореженного голосового сигнала ');
xlabel('Номер отсчета');
ylabel('Амплитуда');
grid on;