% Задание 9: Считывание аудиофайла
[y, Fs] = audioread('voice.wav'); % y - массив отсчетов, Fs - частота дискретизации

% Я записал голос в формате стерео, а мне нужен голос в моно формате.
if size(y, 2) > 1
    y = y(:, 1); 
end

disp(['Частота дискретизации из аудиофайла: ', num2str(Fs), ' GHz']);

%  Задание 10: Расчет частоты дискретизации вручную
% Получаем информацию о файле, чтобы узнать точную длительность
info = audioinfo('voice.wav');
duration = info.Duration; % Длительность записи в секундах
num_elements = length(y); % Количество отсчетов

% Вычисляем частоту: количество элементов делим на длительность
Fs_calculated = num_elements / duration; 

disp(['Количество отсчетов: ', num2str(num_elements)]);
disp(['Длительность записи: ', num2str(duration), ' с']);
disp(['Вычисленная частота дискретизации: ', num2str(Fs_calculated), ' GHz']);