% Задания 3 и 4: Дискретизация сигнала
Fs = 20; % Частота дискретизации по теореме Котельникова (20 Гц)
Ts = 1 / Fs; % Период дискретизации

% Формируем вектор дискретного времени для 1 секунды
% От 0 до 1 секунды с шагом Ts
t_discrete = 0:Ts:1; 

% Вычисляем дискретные отсчеты сигнала
y_discrete = A * sin(2 * pi * f * t_discrete + phase);

figure;
stem(t_discrete, y_discrete, 'r', 'filled', 'LineWidth', 1.5);
grid on;
title('Дискретные отсчеты сигнала (20 Hz)');
xlabel('Время t, (с)');
ylabel('Амплитуда');